app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id].present?
      if !Artist.find_by(id: params[:artist_id]).nil?
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:notice] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
      if !@artist.songs.find_by(id: params[:id]).nil?